import React from 'react'

const About = () => {
  return (
    <div name='Обо мне' className='w-full h-screen bg-gradient-to-b from-gray-800 to-black text-white'>
        <div className='max-w-screen-lg p-4 mx-auto flex flex-col justify-center w-full h-full'>
            <div className='pb-8'>
                <p className='text-4xl font-bold inline border-b-4 border-gray-500'>Обо мне</p>
            </div>
            <p className='text-xl mt-20'>Я начинающий фронтенд-разработчик. Мое погружение в мир программирования началось два года назад, когда я решил исследовать свою любовь к технологиям и отойти от карьеры преподавателя английского языка. Предыдущий карьерный опыт научил меня ценным навыкам, таким как адаптируемость, стрессоустойчивость и способность быстро обучаться новым концепциям, которые, как я считаю, отлично переносятся на мир языков программирования.</p>
    
            <br/>
    
            <p className='text-xl'>Проведя четыре года в преподавании английского языка, я отточил свои навыки коммуникации и развил сильное внимание к деталям. Мне приносит огромное удовлетворение воплощать в жизнь идеи через программирование. Возможность создавать приятные глазу и интуитивно понятные интерфейсы, улучшающие опыт пользователя вдохновляет меня. Мне нравится находиться в коллаборативных средах, где я могу внести свой вклад своим творчеством, навыками решения проблем и преданностью достижению высококачественных результатов.
Я постоянно стремлюсь к возможности расширить свои знания и оставаться в курсе последних тенденций и передовых методов фронтенд-разработки. Я с нетерпением жду возможности внести свой вклад и энтузиазм в динамичную команду, работающую над современными веб-приложениями. 
</p>
        </div>
    </div>
  )
}

export default About